app/Http/Controllers/CompetidorController.php

    public function index()
    {
        //
        $eventos = Evento::all();
---
select * from `eventos` where `eventos`.`deleted_at` is null