app/Http/Controllers/EventoController.php

select * from `eventos` where (`nombre` like '%%' or `descripcion` like '%%' or `lugarEvento` like '%%' or `fechaInicioEvento` like '%%' or `fechaFinEvento` like '%%' or `horaEvento` like '%%' or `lugarEntregaKits` like '%%' or `fechaInicioEntregaKits` like '%%' or `fechaFinEntregaKits` like '%%' or `horaInicioEntregaKits` like '%%' or (exists (select * from `sub_eventos` where `eventos`.`id` = `sub_eventos`.`evento_id` and (`distancia` like '%%' or `categoria` like '%%' or `precio` like '%%' or `rama` like '%%')))) and `eventos`.`deleted_at` is null limit 12 offset 0
select count(*) as aggregate from `eventos` where (`nombre` like '%%' or `descripcion` like '%%' or `lugarEvento` like '%%' or `fechaInicioEvento` like '%%' or `fechaFinEvento` like '%%' or `horaEvento` like '%%' or `lugarEntregaKits` like '%%' or `fechaInicioEntregaKits` like '%%' or `fechaFinEntregaKits` like '%%' or `horaInicioEntregaKits` like '%%' or (exists (select * from `sub_eventos` where `eventos`.`id` = `sub_eventos`.`evento_id` and (`distancia` like '%%' or `categoria` like '%%' or `precio` like '%%' or `rama` like '%%')))) and `eventos`.`deleted_at` is null
---
    public function index(Request $request)
    {

        $search = trim($request->search);
        $eventDeleted = $request->deleted;

        if(!isset($eventDeleted)){

            Cache::forget('deleted');

            $eventos = Evento::with('subEventos')
                ->where('nombre','like',"%{$search}%")
                ->orWhere('descripcion','like',"%{$search}%")
                ->orWhere('lugarEvento','like',"%{$search}%")
                ->orWhere('fechaInicioEvento','like',"%{$search}%")
                ->orWhere('fechaFinEvento','like',"%{$search}%")
                ->orWhere('horaEvento','like',"%{$search}%")
                ->orWhere('lugarEntregaKits','like',"%{$search}%")
                ->orWhere('fechaInicioEntregaKits','like',"%{$search}%")
                ->orWhere('fechaFinEntregaKits','like',"%{$search}%")
                ->orWhere('horaInicioEntregaKits','like',"%{$search}%")
                ->orWhere(function ($query) use ($search){
                    $query->whereHas('subEventos',function ($q) use ($search){
                        $q->where('distancia','like',"%{$search}%")
                            ->orWhere('categoria','like',"%{$search}%")
                            ->orWhere('precio','like',"%{$search}%")
                            ->orWhere('rama','like',"%{$search}%");
                    });
                })
                ->paginate(12)
                ->withQueryString();

update `eventos` set `deleted_at` = '2023-09-05 23:41:37', `eventos`.`updated_at` = '2023-09-05 23:41:37' where `id` = 3
---
    public function destroy(Evento $evento)
    {

        if($evento->trashed()){
            if ($evento->imagen != "Indisponible") {
                Storage::disk('azure')->deleteDirectory($evento->imagen);
                $evento->forceDelete();
            }else{
                $evento->forceDelete();
            }
            $msj = "El evento ha sido eliminado definivamente";
        }else{
            $evento->delete();

select * from `competidors` where (exists (select * from `sub_eventos` where `competidors`.`sub_evento_id` = `sub_eventos`.`id` and `evento_id` = 3 and (`distancia` like '%%' or `categoria` like '%%' or `precio` like '%%' or `rama` like '%%' or `nombre` like '%%' or `apellido` like '%%' or `email` like '%%' or `telefono` like '%%'))) limit 15 offset 0
select * from `sub_eventos` where `sub_eventos`.`id` in (3, 7)
select count(*) as aggregate from `competidors` where (exists (select * from `sub_eventos` where `competidors`.`sub_evento_id` = `sub_eventos`.`id` and `evento_id` = 3 and (`distancia` like '%%' or `categoria` like '%%' or `precio` like '%%' or `rama` like '%%' or `nombre` like '%%' or `apellido` like '%%' or `email` like '%%' or `telefono` like '%%')))
---
    public function inscripciones(Evento $evento,Request $request)
    {

        $search = trim($request->search);

        $competidores = Competidor::with('sub_evento')
                                  ->where(function ($query) use ($search,$evento){
                                      $query->whereHas('sub_evento',function ($quer) use ($search,$evento){
                                          $quer->where('evento_id','=',$evento->id)
                                               ->where(function ($que) use ($search){
                                                    $que->where('distancia','like',"%{$search}%")
                                                        ->orWhere('categoria','like',"%{$search}%")
                                                        ->orWhere('precio','like',"%{$search}%")
                                                        ->orWhere('rama','like',"%{$search}%")
                                                        ->orWhere('nombre','like',"%{$search}%")
                                                        ->orWhere('apellido','like',"%{$search}%")
                                                        ->orWhere('email','like',"%{$search}%")
                                                        ->orWhere('telefono','like',"%{$search}%");
                                          });
                                      });
                                  })
                                  ->paginate(15)
                                  ->withQueryString();